EDT/УТ/src/Documents/ИзменениеСтатусаЗаказа/ИзменениеСтатусаЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеСтатусаЗаказа</name>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплатыДо</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплатыПосле</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/Enums/ВидыЗапросовWEBСервис/ВидыЗапросовWEBСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗапросовWEBСервис</name>
  <enumValues>
    <name>GetMapVersionsResult</name>
  </enumValues>
  <enumValues>
    <name>GetMapResult</name>
  </enumValues>
  <enumValues>
    <name>GetActiveMapVersionResult</name>
  </enumValues>
  <enumValues>
    <name>GetPolygonsForOrdersResult</name>
  </enumValues>
  <enumValues>
    <name>CreateMapResult</name>
  </enumValues>
  <enumValues>
    <name>SetActiveMapVersionResult</name>
  </enumValues>
  <enumValues>
    <name>GetDistanceResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrderCarsResult</name>
  </enumValues>
  <enumValues>
    <name>SetAcceptedPlacesResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrderLocationFlagResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersStatusResult</name>
  </enumValues>
  <enumValues>
    <name>UpdateReasonsDirectoryResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersFinalStatusResult</name>
  </enumValues>
  <enumValues>
    <name>GetOrdersTariffComponentsResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersTariffComponentsResult</name>
  </enumValues>
  <enumValues>
    <name>SetRefusedOrderItemsResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersDeliveryDateResult</name>
  </enumValues>
  <enumValues>
    <name>SetServiceDcResult</name>
  </enumValues>
  <enumValues>
    <name>SetExcludedBarcodesResult</name>
  </enumValues>
  <enumValues>
    <name>DeleteFileResult</name>
  </enumValues>
  <enumValues>
    <name>SaveFileResult</name>
  </enumValues>
  <enumValues>
    <name>GetModifiedOrdersResult</name>
  </enumValues>
  <enumValues>
    <name>SetPendingChangesResult</name>
  </enumValues>
  <enumValues>
    <name>FinalizationPendingChangesResult</name>
  </enumValues>
  <enumValues>
    <name>GetDeliveryCostCalculationTariffsResult</name>
  </enumValues>
  <enumValues>
    <name>getCustomerLinkResult</name>
  </enumValues>
  <enumValues>
    <name>setOrdersStateResult</name>
  </enumValues>
  <enumValues>
    <name>uploadReceiptsResult</name>
  </enumValues>
  <enumValues>
    <name>setOrdersZoneResult</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/СтатусЗаказаИнтернетМагазина/СтатусЗаказаИнтернетМагазина.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусЗаказаИнтернетМагазина</name>
  <predefined>
    <items>
      <name>ЗаказВОбработке</name>
      <description>Заказ в обработке</description>
    </items>
    <items>
      <name>ЗаказЗакрыт</name>
      <description>Заказ закрыт</description>
    </items>
    <items>
      <name>ЗаказЗакрытСтарый</name>
      <description>Заказ закрыт</description>
    </items>
    <items>
      <name>ЗаказОтклонен</name>
      <description>Заказ отклонен</description>
    </items>
    <items>
      <name>НовыйЗаказ</name>
      <description>Новый заказ</description>
    </items>
  </predefined>
</mdclass:Catalog>

EDT/УТ/src/Documents/ИзменениеСтатусаЗаказа/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	Отказ = Не Проведение1С();
	ИзменениеТипаОплаты();
КонецПроцедуры

Функция Проведение1С()
	Попытка
		ПодключениеКМагазину = Евген.СоздатьПодключениеКИнтернетМагазину(); 
	Исключение
		НормальныйХодВыполнения = Ложь;
		Возврат Ложь;
	КонецПопытки;
	
	Если СтатусЗаказа = справочники.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен Тогда
		Р = Заказ.ПолучитьОбъект();
		Если Р.Проведен Тогда
			Р.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецеСли;
		
		Р.СтатусИнтернетМагазина = 4;
		Р.ПометкаУдаления = Истина;
		Р.Записать(РежимЗаписиДокумента.Запись);
		
		
		П = Документы.ПеремещениеТоваров.НайтиПоНомеру(Заказ.Номер);
		Если Не П.Пустая() Тогда
			П = П.ПолучитьОбъект();
			Если П.Проведен Тогда
				П.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецеСли;
			
			П.ПометкаУдаления = Истина;
			П.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		П = Документы.ПоступлениеТоваровУслуг.НайтиПоНомеру(Заказ.Номер);
		Если Не П.Пустая() Тогда
			П = П.ПолучитьОбъект();
			Если П.Проведен Тогда
				П.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецеСли;
			
			П.ПометкаУдаления = Истина;
			П.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		В = Документы.ПоступлениеТоваровУслуг.НайтиПоНомеру(Заказ.Номер);
		Если Не В.Пустая() Тогда
			В = В.ПолучитьОбъект();
			
			Если В.Проведен Тогда
				В.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецеСли;
			
			В.ПометкаУдаления = Истина;
			В.Записать(РежимЗаписиДокумента.Запись);
		КонецЕСли;
		УстановитьСтатусСтрижаВАдминке(СокрЛП(Р.Номер), "4", ПодключениеКМагазину);
	ИначеЕсли СтатусЗаказа = справочники.СтатусЗаказаИнтернетМагазина.ЗаказВОбработке Тогда
		Р = Заказ.ПолучитьОбъект();
		Если Р.Проведен Тогда
			Р.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецеСли;
		
		Р.СтатусИнтернетМагазина = 2;
		Р.ПометкаУдаления = Ложь;
		Р.Записать(РежимЗаписиДокумента.Запись);
		
		
		П = Документы.ПеремещениеТоваров.НайтиПоНомеру(Заказ.Номер);
		Если Не П.Пустая() Тогда
			П = П.ПолучитьОбъект();
			Если П.Проведен Тогда
				П.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецеСли;
			
			П.ПометкаУдаления = Ложь;
			П.Записать(РежимЗаписиДокумента.Запись);
		КонецеСли;
		
		П = Документы.ПоступлениеТоваровУслуг.НайтиПоНомеру(Заказ.Номер);
		
		Если Не П.Пустая() Тогда
			П = П.ПолучитьОбъект();
			Если П.Проведен Тогда
				П.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецеСли;
			
			П.ПометкаУдаления = Ложь;
			П.Записать(РежимЗаписиДокумента.Запись);
		КонецеСли;
		
		В = Документы.ПоступлениеТоваровУслуг.НайтиПоНомеру(Заказ.Номер);
		Если Не В.Пустая() Тогда
			В = В.ПолучитьОбъект();
			Если В.Проведен Тогда
				В.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецеСли;
			
			В.ПометкаУдаления = Ложь;
			В.Записать(РежимЗаписиДокумента.Запись);
		КонецеСли;
		УстановитьСтатусСтрижаВАдминке(СокрЛП(Р.Номер), "2", ПодключениеКМагазину);
	ИначеЕсли СтатусЗаказа = справочники.СтатусЗаказаИнтернетМагазина.НовыйЗаказ Тогда
		Р = Заказ.ПолучитьОбъект();
		Если Р.Проведен Тогда
			Р.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецеСли;
		
		Р.СтатусИнтернетМагазина = 1;
		Р.ПометкаУдаления = Ложь;
		Р.Записать(РежимЗаписиДокумента.Запись);
		
		
		П = Документы.ПеремещениеТоваров.НайтиПоНомеру(Заказ.Номер);
		П = Документы.ПоступлениеТоваровУслуг.НайтиПоНомеру(Заказ.Номер);
		Если Не П.Пустая() Тогда
			П = П.ПолучитьОбъект();
			Если П.Проведен Тогда
				П.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецеСли;
			
			П.ПометкаУдаления = Ложь;
			П.Записать(РежимЗаписиДокумента.Запись);		
		КонецеСли;
		
		П = Документы.ПоступлениеТоваровУслуг.НайтиПоНомеру(Заказ.Номер);
		Если Не П.Пустая() Тогда
			П = П.ПолучитьОбъект();
			Если П.Проведен Тогда
				П.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецеСли;
			
			П.ПометкаУдаления = Ложь;
			П.Записать(РежимЗаписиДокумента.Запись);		
		КонецеСли;
		
		В = Документы.ВозвратТоваровОтПокупателя.НайтиПоНомеру(Заказ.Номер);
		Если Не В.Пустая() Тогда
			В = В.ПолучитьОбъект();
			Если В.Проведен Тогда
				В.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецеСли;
			
			В.ПометкаУдаления = Ложь;
			В.Записать(РежимЗаписиДокумента.Запись);		
		КонецеСли;
		УстановитьСтатусСтрижаВАдминке(СокрЛП(Р.Номер), "1", ПодключениеКМагазину);
	КонецеСли;	
	
	Если Перенос Тогда
		Д = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(заказ.Номер);
		Если Не Д.Пустая() Тогда
			Д.Дата = ДатаПереноса;
			
			ЧН = Час(Д.ВремяОтправленияС);
			ЧК = Час(Д.ВремяОтправленияПо);
			
			МН = Минута(Д.ВремяОтправленияС);
			МК = Минута(Д.ВремяОтправленияПо);
			
			ЧН_ = Час(Д.ВремяПрибытияС);
			ЧК_ = Час(Д.ВремяПрибытияПо);
			
			МН_ = Минута(Д.ВремяПрибытияС);
			МК_ = Минута(Д.ВремяПрибытияПо);
			
			
			Д.ВремяОтправленияС = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			Д.ВремяОтправленияПо = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Д.ВремяПрибытияС = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			Д.ВремяПрибытияПо = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Д.Записать();
		КонецеСли;
		
		Р.Дата = ДатаПереноса;
		
		УстановитьДатуВАдминке(СокрЛП(Р.Номер), ДатаПереноса, ПодключениеКМагазину);
		УстановитьСтатусСтрижаВАдминке(СокрЛП(Р.Номер), "2", ПодключениеКМагазину);
	КонецеСли;	
	Возврат Истина;
КонецФункции	



Процедура УстановитьДатуВАдминке(НомерЗ, ДатаЗ, Подкл)
	// ++Задача № 3381	
	//Ткст = "
	//|UPDATE _order
	//|SET DeliveryDate = '" + Евген.ДатаВSQL(ДатаЗ, Ложь) + "'
	//| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
	//|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	//Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
	
	ПараметрыЗаказа = Новый Структура("OrderId, DeliveryDate, Who",
	Число(НомерЗ), ДатаЗ, СокрЛП(ПараметрыСеанса.ТекущийПользователь));
	
	ПараметрыЗапроса = новый Массив;
	ПараметрыЗапроса.Добавить(ПараметрыЗаказа);
	
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		ФайлДляКонтроля = "D:\tmp\SetOrdersDeliveryDate_" + СокрЛП(НомерЗ) + ".json";
		ТолькоСохранитьФайл = Ложь;
	Иначе
		ФайлДляКонтроля = Неопределено;
		ТолькоСохранитьФайл = Ложь;
	КонецЕсли;

	РезультатОтправки = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(
	Перечисления.ВидыЗапросовWEBСервис.SetOrdersDeliveryDateResult, 
	ПараметрыЗапроса, 
	ФайлДляКонтроля, 
	ТолькоСохранитьФайл);
	// --Задача № 3381
	
    ////Серегин М.В. 30.07.2015 17:43:20 старый код
    //Ткст = "
    //|UPDATE _order
    //|SET carid = 0
    //| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
    //|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
    //Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    ////Серегин М.В. 30.07.2015 17:43:25 новый
    Ткст = "
	|EXEC p1c_removeCarriageFromOrder " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    //Серегин М.В. 30.07.2015 17:43:27 
	
КонецПроцедуры	


Процедура УстановитьСтатусСтрижаВАдминке(НомерЗ, Статус, Подкл)
	Ткст = "
	|UPDATE _order
	|SET Status = " + Статус + "
	| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
КонецПроцедуры	


Процедура ОбработкаУдаленияПроведения(Отказ)
	Отказ = Истина;
КонецПроцедуры


Процедура ИзменениеТипаОплаты()
	если Заказ.СтатусИнтернетМагазина = 2 И Не ТипОплатыДо.Пустая() И Не ТипОплатыПосле.Пустая() И ТипОплатыПосле <> ТипОплатыДо Тогда
		Подкл = Евген.СоздатьПодключениеКИнтернетМагазину();
		
		ТекстЗапроса = "EXEC import_setOrderPayType " + СокрЛП(Заказ.Номер) + ", " + Формат(ТипОплатыПосле.Код, "ЧГ=");
		Евген.ЗапросКИнтернетМагазину(ТекстЗапроса, Подкл);
		
		//Евген.ЗапросКИнтернетМагазину("UPDATE _order set pay_type = " + Формат(ТипОплатыПосле.Код, "ЧГ=") + " where orderid = " + СокрЛП(Заказ.Номер), Подкл);
		Д = Заказ.ПолучитьОбъект();
		Д.ТипОплаты = ТипОплатыПосле.Код;
		Д.Записать(РежимЗаписиДокумента.Запись);
	КонецеСли;	
Конецпроцедуры
